{"class_name": "Model", "keras_version": "1.2.0", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 80, 320, 3], "input_dtype": "float32", "name": "input_2", "sparse": false}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"nb_filter": 24, "nb_col": 5, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_7", "subsample": [2, 2], "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"nb_filter": 32, "nb_col": 1, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 1, "name": "convolution2d_8", "subsample": [1, 1], "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"strides": [2, 2], "border_mode": "same", "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2]}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"nb_filter": 32, "nb_col": 5, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_9", "subsample": [2, 2], "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "border_mode": "same", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"output_mask": null, "output_shape": null, "mode": "concat", "output_shape_type": "raw", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "name": "merge_2", "arguments": {}}, "inbound_nodes": [[["maxpooling2d_2", 0, 0], ["convolution2d_9", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"nb_filter": 64, "nb_col": 5, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_10", "subsample": [2, 2], "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"nb_filter": 72, "nb_col": 3, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_11", "subsample": [2, 2], "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_12", "config": {"nb_filter": 72, "nb_col": 3, "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "name": "convolution2d_12", "subsample": [1, 1], "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "border_mode": "valid", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"input_dim": 1152, "activity_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "output_dim": 512, "trainable": true, "name": "dense_5"}, "inbound_nodes": [[["flatten_2", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}, "inbound_nodes": [[["dense_5", 0, 0]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"input_dim": 512, "activity_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "output_dim": 128, "trainable": true, "name": "dense_6"}, "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "p": 0.2}, "inbound_nodes": [[["dense_6", 0, 0]]]}, {"class_name": "Dense", "name": "dense_7", "config": {"input_dim": 128, "activity_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "tanh", "W_constraint": {"name": "MaxNorm", "m": 4, "axis": 0}, "b_constraint": null, "output_dim": 24, "trainable": true, "name": "dense_7"}, "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "p": 0.2}, "inbound_nodes": [[["dense_7", 0, 0]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"input_dim": 24, "activity_regularizer": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "activation": "tanh", "W_constraint": null, "b_constraint": null, "output_dim": 1, "trainable": true, "name": "dense_8"}, "inbound_nodes": [[["dropout_6", 0, 0]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_8", 0, 0]]}}